In [34]:
#Ques1-1. Write a script to calculate the average age of employees grouped by their job titles.

In [ ]:
import pandas as pd

In [7]:
df1=pd.read_csv('Assgn6_ques1.csv')

In [8]:
df1

  job_title  age
0   Manager   45
1  Engineer   30
2   Manager   35
3  Engineer   28
4   Manager   50

In [37]:
df1.groupby('job_title')['age'].mean().reset_index(name='Average_Age')

  job_title  Average_Age
0  Engineer    29.000000
1   Manager    43.333333

In [ ]:
#Ques2 Write a script to count the number of employees in each department

In [18]:
df2=pd.read_csv('Assgn6_ques2.csv')

In [19]:
df2.groupby('deptno')['ename'].count().reset_index(name='count_of_emp')

   deptno  count_of_emp
0       1             2
1       2             2
2       3             1

In [ ]:
# Ques 4 Write a script to find the maximum salary in each department

In [29]:
df3=pd.read_csv('Assgn6_ques4.csv')

In [32]:
groupd=df3.groupby('deptno')['salary'].max().reset_index(name='Max_salary')

In [33]:
groupd

   deptno  Max_salary
0       1       60000
1       2       70000

In [ ]:
# Ques 5 Write a script to group employees by their city and find the total number of employees in each city.

In [42]:
df1=pd.read_csv('Assgn6_ques5.csv')

In [43]:
df1

          city    ename  emp
0     New York    Alice   10
1  Los Angeles      Bob   12
2     New York  Charlie   10
3      Chicago    David    5
4  Los Angeles      Eve   10

In [44]:
df1.groupby('city')['ename'].count().reset_index(name='count_of_employees')

          city  count_of_employees
0      Chicago                   1
1  Los Angeles                   2
2     New York                   2

In [ ]:
# Ques 6-Write a script to find the minimum and maximum age of employees grouped by their gender

In [47]:
df1=pd.read_csv('Assgn6_ques6.csv')

In [48]:
df1

  gender  age
0      M   30
1      F   25
2      M   35
3      F   28
4      M   40

In [49]:
df1.groupby('gender')['age'].agg(['max','min'])

        max  min
gender
F        28   25
M        40   30

In [ ]:
#ques7-. Write a script to calculate the total sales per product category.

In [52]:
df1=pd.read_csv('Assgn6_ques7.csv')

In [53]:
df1

      category  sales
0  Electronics   1000
1     Clothing    500
2  Electronics   1500
3    Groceries    700
4     Clothing    800

In [57]:
group=df1.groupby('category')['sales'].sum().reset_index(name='Total_Sales')

In [58]:
group

      category  Total_Sales
0     Clothing         1300
1  Electronics         2500
2    Groceries          700

In [ ]:
#8.Write a script to calculate the average salary per department and store the results in a new DataFrame.

In [60]:
df1=pd.read_csv('Assgn6_ques8.csv')

In [61]:
df1

   deptno    ename  salary
0       1    Alice   50000
1       1      Bob   60000
2       2  Charlie   55000
3       2    David   70000
4       1      Eve   60000
5       3    Frank   45000
6       3    Grace   48000

In [62]:
groupdept=df1.groupby('deptno')['salary'].mean().reset_index(name='Avg_Sal_by_dept')

In [63]:
groupdept

   deptno  Avg_Sal_by_dept
0       1     56666.666667
1       2     62500.000000
2       3     46500.000000

In [64]:
#3. Write a script to sort employees by their joining date in descending order.

In [66]:
df3=pd.read_csv('Assgn6_ques3.csv')

In [69]:
df3.sort_values(by='joining_date',ascending=False)

     ename joining_date
2  Charlie   2021-03-30
4      Eve   2020-11-10
0    Alice   2020-01-15
1      Bob   2019-05-20
3    David   2018-08-12

In [70]:
nums=[2,4,5,7,8,9,10]

In [71]:
print(nums)

[2, 4, 5, 7, 8, 9, 10]

In [74]:
even =list(filter(lambda x: x%2==0,nums))

In [75]:
print(even)

[2, 4, 8, 10]